PRACTICANDO PANDAS JEJE

In [6]:
import pandas as pd #pd es ula forma universal de llamar pandas

#leyendo un archo csv y creaando el dataframe
df=pd.read_csv("archivo.csv", names=["name","lastname","age"])
# Tambi√©n cambiamos el nombre del encabezado
df

#Elimiando la fila 0
df.drop([0], axis=0, inplace=True)
df

       name    lastname age
1     Luisa    Llorente  21
2  Geraldin  De la Ossa  26
3   Armando      Torres  25
4     Tonny      Rivero  29

In [7]:
#ordenando nuestro dataframe por edad 
df_ordenado_ascendente= df.sort_values("age")
df_ordenado_ascendente

       name    lastname age
1     Luisa    Llorente  21
3   Armando      Torres  25
2  Geraldin  De la Ossa  26
4     Tonny      Rivero  29

In [13]:
#Ordenando de forma descendete


df_descendente=df.sort_values("age",ascending=False)
df_descendente
df_descendente.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 4 to 1
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   lastname  4 non-null      object
 2   age       4 non-null      int32
dtypes: int32(1), object(2)
memory usage: 112.0+ bytes

In [12]:
df.info()

#Convertir age a int 
df['age'] = df['age'].astype(int)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   lastname  4 non-null      object
 2   age       4 non-null      int32
dtypes: int32(1), object(2)
memory usage: 212.0+ bytes

In [15]:
#Concatenando 

df_concatenado=pd.concat([df_descendente,df_ordenado_ascendente])
df_concatenado

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 4 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      8 non-null      object
 1   lastname  8 non-null      object
 2   age       8 non-null      object
dtypes: object(3)
memory usage: 256.0+ bytes

In [17]:
#Accediendo a las filas mayores que 24

mayores_25=df.loc[df["age"]>25,:]
print(mayores_25)

       name    lastname  age
2  Geraldin  De la Ossa   26
4     Tonny      Rivero   29

In [16]:
#Obteniendo data estadistica del dataframe:
df.describe()

             age
count   4.000000
mean   25.250000
std     3.304038
min    21.000000
25%    24.000000
50%    25.500000
75%    26.750000
max    29.000000